/** 
 * printInit
 * =========
 * 
 * 설명: 시작 화면을 아래와 같이 프린트합니다.
 * 
 * --------------------------------
 * 
 * ```
 * 
 * ====================================================================
 * --------------     KOSTA 은행 계좌 관리 프로그램     ---------------
 * ====================================================================
 * 
 * ```
 */

const printInit = function () {
console.log(`====================================================================`);
console.log(`--------------     KOSTA 은행 계좌 관리 프로그램     ---------------`);
console.log(`====================================================================`);
}

/** 
 * printMenu
 * =========
 * 
 * 설명: 계좌 종류를 아래와 같이 프린트합니다.
 * 
 * --------------------------------
 * 
 * ```
 * 
 * --------------------------------------------------------------------
 * 1.계좌등록 | 2.계좌목록 | 3.예금 | 4.출금 | 5.검색 | 6.삭제 | 7.종료
 * --------------------------------------------------------------------
 * 
 * ```
 */
const printMenu = function () {
    console.log("--------------------------------------------------------------------");
    console.log("1.계좌등록 | 2.계좌목록 | 3.예금 | 4.출금 | 5.검색 | 6.삭제 | 7.종료");
    console.log("--------------------------------------------------------------------");
}

/** 
 * printAccountType
 * ================
 * 
 * 설명: 계좌 종류를 아래와 같이 프린트합니다.
 * 
 * --------------------------------
 * 
 * ```
 * 
 * --------------------------------
 * 1. 입출금계좌 | 2. 마이너스 계좌
 * --------------------------------
 * 
 * ```
 */
const printAccountType = function () {
    console.log("■ 등록 계좌 종류 선택");
    console.log("--------------------------------");
    console.log("1. 입출금계좌 | 2. 마이너스 계좌");
    console.log("--------------------------------");
}


/** 
 * printSearchBy
 * =============
 * 설명: 계좌 검색 기준을 아래와 같이 프린트합니다.
 * 
 * --------------------------------
 * ```
 * 
 * ■ 등록 계좌 종류 선택
 * ---------------------
 * 1. 이름 | 2. 계좌번호
 * ---------------------
 * 
 * ```
 */
const printSearchBy = function () {
    console.log("■ 검색 종류 선택");
    console.log("-------------------------------");
    console.log("1. 이름 | 2. 계좌번호 | 3. 잔고");
    console.log("-------------------------------");
}

/**
 * printAccountList
 * ================
 * 설명: 파라미터의 결과값에 따라 예금주, 계좌번호, 예수금, 부채, 잔고를 순차적으로 ```console.log()``` 합니다.
 * 
 * --------------------------------
 * 
 * ```
 * 
 * -----------------------------------------------------
 * 예금주        계좌번호        예수금   부채     잔고 
 * 엄준식    123-4567-7898-76    10000            10000
 * 김찬호    987-6543-2123-45    1000    10000    -9000
 * -----------------------------------------------------
 * 
 * ```
 */
const printAccountList = function (targetAccount) {
    console.log("-------------------------------------------------------");
    console.log(" 예금주 \t 계좌번호 \t 예수금 \t 부채 \t 잔고 ");
    console.log(targetAccount);
    console.log("-------------------------------------------------------");
}

module.exports = {
    printInit,
    printMenu,
    printSearchBy,
    printAccountType,
    printAccountList,
}